;
(function 六加(盾盾, 加好, 固零, 六全, 喵哈, 哒嘿, 盾喵, 固点, 哒淆, 哒全, 零固, 哒混, 喵固, 咪喵) {
  function 固哒(固加, 六固) {
    var 零全 = 固加 ^ 六固;
    var 点混 = 加好[零全];
    var 加喵 = 零固(哒混(喵固(点混, "")), 哒全(66666 - 零全));
    var 嘿点 = [];
    if (咪喵[加喵] !== undefined) {
      return 咪喵[加喵];
    }
    for (var 加零 = 0; 加零 < 点混.length; 加零++) {
      盾喵(嘿点, 固点(点混, 加零) - 加零 - 六固);
    }
    return 咪喵[加喵] = 哒淆(嘿点);
  }
  (function 呀喵(加混, 加呀, 好全, 哒呀, 嘿哈) {
    加呀 = 加呀 || [];
    好全 = 好全 || [];
    哒呀 = 哒呀 || [];
    var 固喵 = 好全.length;
    var 加咪;
    for (var 点哈; 点哈 = 盾盾[加混++];) {
      if (点哈 > 94) {
        if (点哈++ < 103 || (点哈 > 117 && (点哈 > 124 && (好全[++固喵 - ++点哈 + 125] = 加好[盾盾[加混++] ^ 点哈-- + 47980 + 加混], !undefined) || (点哈 > 122 || (点哈 < 121 && ((点哈 > 119 || (点哈 > 118 && (好全[++固喵 - 点哈 + 116] = 好全[(固喵 -= 点哈--) + 116] === 好全[(固喵 += 117) - ++点哈 + 119], !false) || (好全[++固喵 - ++点哈 + 118] = false), !{})) && (好全[++固喵 + ++点哈 - 125] = 哒嘿(好全[--固喵 - 点哈++ + 119])(好全[(固喵 += 点哈++) - 125], 好全[(固喵 -= 124) + 点哈-- - 122])(固哒(盾盾[加混++] ^ 45221 + 加混, 盾盾[加混++] ^ 点哈-- + 58463 + 加混))), !undefined) || 点哈 > 121 && (好全[加混++, --固喵 + 点哈-- - 122] && (加混 = 盾盾[--加混] ^ ++点哈 + 26078 + ++加混), !"") || 哒嘿(好全[(固喵 -= 点哈) + 118], 好全[(固喵 -= 点哈++) + 238], 好全[固喵 + 点哈-- + 118])(好全[(固喵 += 238) + --点哈 - 117])(), false)) && (点哈 < 124 && (好全[++固喵 + --点哈 - 124] = 好全[固喵-- - --点哈 + 119][固哒(盾盾[加混++] ^ ++点哈 + 54723 + 加混, 盾盾[加混++] ^ 18778 + 加混)], !"") || (好全[++固喵 + --点哈 - 125] = !!好全[--固喵 - 点哈++ + 122])), []) || (点哈 < 111 || ((点哈 > 114 || (点哈 > 113 && (好全[--固喵 - --点哈 + 112] = 加呀[好全[(固喵 -= 62) + 点哈 - 52]] = 好全[固喵 += 62], !false) || (点哈-- > 112 || ((点哈 > 110 || (function () {
          throw 好全[(固喵 += 2) - 3];
        }(), undefined)) && (好全[(固喵 -= 点哈++) + 108] = new (喵哈(好全[固喵-- + ++点哈 - 5], [null, 好全[固喵 - --点哈 + 222], 好全[(固喵 += 110) - --点哈 + 112]]))()), "")) && (好全[(固喵 += 55) + 点哈++ - 169] = 好全[固喵 + 点哈++ - 170] !== 加呀[好全[(固喵 -= 56) - ++点哈 + 115]]), false)) && (点哈 > 116 && (好全[++固喵 - --点哈 + 114] = 固零[好全[--固喵 + 点哈-- - 117]], !false) || (点哈 > 115 || (好全[(固喵 += 点哈--) - 117] = 好全[++固喵 - 点哈 - 4][好全[(固喵 -= 117) + 点哈-- - 114]], 0)) && function () {
          debugger;
        }()), "")) && (++点哈 < 107 || ((点哈 > 108 || (点哈 > 107 && (好全[固喵++ - 点哈 + 107] = -好全[固喵-- + --点哈 - 109], !null) || (好全[固喵 + ++点哈 - 109] = !!好全[固喵 + 点哈-- - 109]), 0)) && (点哈 > 110 && (加呀[好全[固喵++ - 点哈-- + 109]] = 好全[(固喵 -= 3) + 点哈++ - 109], !"") || 点哈 > 109 && (好全[固喵-- + 点哈++ - 112] = 好全[--固喵 - 点哈 + 111][好全[++固喵 + 点哈++ - 111]] = 盾盾[加混++] - (++点哈 + 35270 + 加混), true) || (好全[++固喵 + --点哈 - 109] = [][{}])), undefined)) && (点哈 > 105 && (好全[固喵-- - 2] |= 好全[固喵 + ++点哈 - 107], true) || (好全[固喵 - ++点哈 + 105] <<= 盾盾[加混++] - (2600 + 加混))), false)) {
          if (!(++点哈 > 103) || !(好全[固喵++ + --点哈 - 103] = 加呀[盾盾[加混++] ^ -点哈-- + 21495 + 加混], !"")) {
            if (点哈 < 100 || (点哈 < 102 && ((点哈 > 100 || (好全[--固喵 + --点哈 - 99] = 固零[好全[++固喵 + 点哈-- - 100]], false)) && (好全[(固喵 -= 4) - --点哈 + 102] && (加混 = 好全[固喵 - --点哈 + 102]), (固喵 += 2) - 点哈++ + 173), !undefined) || 点哈 < 103 && (好全[++固喵 - 点哈-- + 99] = 好全[固喵++ + 点哈-- - 104] === 好全[(固喵 -= 3) + 点哈-- - 100], []) || (好全[固喵++ + 点哈 - 103] = 盾盾[加混++] - (-点哈-- + 加混)), undefined)) {
              if (!(点哈 < 98) || !(好全[--固喵 - 1] = 好全[固喵++ - 1][好全[固喵-- - 点哈 + 96]] = 盾盾[加混++] - (-点哈-- + 27354 + 加混), [])) {
                if (点哈 > 98 || (哒嘿(好全[固喵++ - 1], 好全[(固喵 -= 3) + 点哈 - 98])()(), !{})) {
                  好全[++固喵 - 4] = 喵哈(好全[(固喵 -= 47) + 点哈 - 55], [好全[固喵 + 点哈-- - 56], 好全[(固喵 += 44) - 点哈-- + 99], 盾盾[加混++] - (-点哈++ + 60825 + 加混)])();
                }
              }
            }
          }
        }
      } else if (点哈 > 63) {
        if (点哈 < 72) {
          if (!(点哈 < 67) || !(++点哈 < 66 && (好全[固喵++ - 点哈 + 65] = null, !false) || 点哈++ < 67 && (好全[固喵++ + --点哈 - 68] || (加混 = 好全[固喵 - 点哈++ + 64]), (固喵 -= 3) - ++点哈 + 170, true) || 哒嘿(好全[(固喵 -= 30) + 28], 好全[固喵-- + 点哈-- - 41])()(好全[(固喵 += 28) + ++点哈 - 66]), true)) {
            if (点哈++ > 70 || ((点哈 < 70 || (点哈 > 70 && (好全[--固喵 - 点哈++ + 68] = 六全(好全[++固喵 - 点哈-- + 69], 好全[(固喵 += --点哈) - 74], 好全[固喵++ - 点哈 - 2], 好全[(固喵 -= 74) + 2])(), true) || (好全[++固喵 + ++点哈 - 74] = new RegExp(好全[(固喵 -= 85) - --点哈 + 152], 好全[(固喵 += 83) - 点哈-- + 70])), null)) && (点哈 > 68 || (加呀[好全[++固喵 - 3]] = 好全[(固喵 -= 3) + 点哈++ - 67], false)) && (好全[--固喵 - ++点哈 + 71] = 好全[(固喵 += 2) - 2]), false)) {
              好全[++固喵 + --点哈 - 72] = {};
            }
          }
        } else if (点哈 > 85) {
          if (点哈 < 89) {
            if (点哈 < 87) {
              if (好全[++固喵 - 点哈-- + 83]) {
                加混 = 好全[固喵 - 2];
              }
              (固喵 -= 3) + ++点哈 - 56;
            } else if (--点哈 < 87) {
              好全[固喵++ - --点哈 + 83] = 好全[固喵-- + 点哈-- - 88] != !好全[--固喵 + --点哈 - 83];
            } else {
              return 嘿哈.固全 = 0;
            }
          } else if ((点哈 < 91 || ((++点哈 > 93 || (点哈 < 93 && (好全[++固喵 + 点哈 - 93] = 好全[好全[++固喵 - 点哈 + 91] = 好全[固喵++ + 点哈-- - 95], --固喵 - ++点哈 + 88], 1) || (好全[固喵++ - 点哈 + 93] = 固哒(盾盾[加混++] ^ - --点哈 + 22153 + 加混, 盾盾[加混++] ^ -点哈 + 35636 + 加混)), false)) && (点哈 < 95 && (好全[++固喵 + 点哈 - 95] = 加好[盾盾[加混++] ^ 点哈++ + 加混], []) || (加呀[好全[固喵 - ++点哈 + 95]] = 好全[++固喵 + ++点哈 - 101].slice(好全[(固喵 -= 点哈) + 94], 好全[(固喵 += 93) + 点哈++ - 97].length))), false)) && (点哈 < 90 || (好全[(固喵 -= 15) + 13] = 好全[++固喵 + --点哈 - 77] == 好全[(固喵 += 13) + 点哈++ - 89], false))) {
            好全[固喵++ + 点哈++ - 88] = 盾盾[好全[固喵++ + ++点哈 - 92] = 盾盾[加混++] - (点哈-- + 8799 + 加混), 加混++] ^ 点哈-- + 32680 + 加混;
          }
        } else if (点哈 < 79) {
          if ((!(++点哈 < 75) || !(点哈 > 73 && (好全[(固喵 -= 6) + 4] || (加混 = 好全[固喵 + 5]), (固喵 += 4) + 点哈 - 71, []) || (好全[++固喵 + 点哈-- - 74] = 固零[固哒(盾盾[加混++] ^ -点哈 + 35698 + 加混, 盾盾[加混++] ^ --点哈 + 61384 + 加混)]), !"")) && (!(点哈 > 76) || !((点哈 > 78 || ((点哈 < 78 || (好全[++固喵 + 点哈-- - 81] = 好全[固喵-- - ++点哈 + 75] != 好全[固喵-- + ++点哈 - 80], false)) && (好全[(固喵 += 31) - 点哈 + 44] = 喵哈(好全[固喵-- - 32], [好全[(固喵 -= 31) + 点哈++ - 78]])()), 0)) && (好全[固喵++ + ++点哈 - 80] = void (盾盾[加混++] - (-点哈-- + 37713 + 加混))), !null))) {
            if (点哈 < 76 || (好全[(固喵 += 点哈--) - 78] = 加呀[好全[固喵-- - --点哈 - 4]] = 好全[(固喵 -= 76) + 点哈 - 74], false)) {
              好全[(固喵 -= 80) + 点哈 + 3] = new (喵哈(好全[--固喵 + 79], [null, 好全[(固喵 += 80) - ++点哈 + 76]]))();
            }
          }
        } else if (点哈-- < 81) {
          if (点哈 > 78) {
            好全[(固喵 -= ++点哈) + 78] = 好全[固喵 + 点哈-- - 2] !== 好全[(固喵 += 79) - --点哈 + 78];
          } else {
            try {
              var 哈盾 = 好全[固喵-- - 点哈++ + 74];
              var 哈混 = 好全[固喵-- - 点哈 + 77];
              var 六喵 = 好全[--固喵 + 点哈-- - 78];
              var 喵全 = 好全[--固喵 + 点哈 - 75];
              var 淆六 = {
                固全: 1
              };
              var 加六 = 呀喵(加混, 加呀, [], 哒呀, 淆六);
              if (淆六.固全) {
                return 加六;
              }
              if (淆六.呀盾 !== undefined) {
                哈盾 = 淆六.呀盾;
                if (淆六.六淆 > 1) {
                  嘿哈.呀盾 = 哈盾;
                  嘿哈.六淆 = --淆六.六淆;
                  return 嘿哈.固全 = 0;
                }
              }
            } catch (盾淆) {
              加呀[喵全] = 盾淆;
              淆六 = {
                固全: 1
              };
              加六 = 呀喵(哈混, 加呀, [], 哒呀, 淆六);
              if (淆六.固全) {
                return 加六;
              }
              if (淆六.呀盾 !== undefined) {
                哈盾 = 淆六.呀盾;
                if (淆六.六淆 > 1) {
                  嘿哈.呀盾 = 哈盾;
                  嘿哈.六淆 = --淆六.六淆;
                  return 嘿哈.固全 = 0;
                }
              }
            } finally {
              淆六 = {
                固全: 1
              };
              加六 = 呀喵(六喵, 加呀, [], 哒呀, 淆六);
              if (淆六.固全) {
                if (嘿哈) {
                  嘿哈.固全 = 1;
                }
                return 加六;
              }
              if (淆六.呀盾 !== undefined) {
                哈盾 = 淆六.呀盾;
                if (淆六.六淆 > 1) {
                  嘿哈.呀盾 = 哈盾;
                  嘿哈.六淆 = --淆六.六淆;
                  return 嘿哈.固全 = 0;
                }
                return 呀喵(哈盾, 加呀, [], 哒呀);
              }
              加混 = 哈盾;
            }
          }
        } else if (!(点哈 < 81) || !(加混 = 盾盾[加咪 = 加混, 加混++] ^ -点哈++ + 57495 + 加混, !undefined)) {
          if (点哈 > 81 || (好全[固喵++ + ++点哈 - 83] = 加呀[好全[固喵-- + ++点哈 - 85]], undefined)) {
            if (!(点哈 > 83) || !(好全[好全[固喵-- - --点哈 + 83] = [], 固喵++ - ++点哈 + 86] = 好全[(固喵 += 2) - ++点哈 + 83], {})) {
              if (++点哈 < 84 || (好全[固喵++ + 点哈 - 84] = false, undefined)) {
                好全[--固喵] = +好全[++固喵 - 1];
              }
            }
          }
        }
      } else if (点哈-- < 33) {
        if (点哈 > 24) {
          if (!(点哈 > 28) || !((点哈 < 30 || ((点哈-- > 30 || (好全[++固喵 - ++点哈 + 26] = 哒嘿(好全[固喵++ - 3])(好全[固喵 - ++点哈 + 26], 好全[(固喵 -= 4) - ++点哈 + 33], 固哒(盾盾[加混++] ^ --点哈 + 2852 + 加混, 盾盾[加混++] ^ -点哈 + 16399 + 加混))(), !{})) && (好全[固喵++ + ++点哈 - 31] = 盾盾[加混++] ^ -点哈-- + 加混), false)) && (好全[固喵-- - 点哈 + 29] = 好全[(固喵 += 2) + 点哈++ - 31]), true)) {
            if ((点哈 < 27 || (点哈 < 28 && (加呀[好全[固喵 - ++点哈 + 27]] = 好全[++固喵 + 点哈++ - 32].slice(好全[(固喵 += 15) - 点哈 + 11], 好全[(固喵 -= 19) - --点哈 + 28].length), 1) || (好全[固喵-- - 2] = 好全[固喵-- + 点哈 - 29] == !好全[固喵++ + ++点哈 - 28]), false)) && (点哈 < 26 || (好全[--固喵 - 7] = function (咪淆, 零六, 嘿固, 盾哒, 混喵, 混混, 固固, 点呀) {
              var 六零 = 哒呀.concat([加呀]);
              return function 零哒() {
                var 盾点 = arguments.length > 混喵.length ? 混喵.length : arguments.length;
                var 点好 = [];
                for (var 加零 = 0; 加零 < 盾点; 加零++) {
                  点好[混喵[加零]] = arguments[加零];
                }
                if (嘿固) {
                  点好[零六] = arguments;
                }
                if (固固) {
                  点好[盾哒] = this;
                }
                if (咪淆) {
                  Object.defineProperty(点好, 点呀, {
                    value: 零哒,
                    writable: false
                  });
                }
                return 呀喵(混混, 点好, [], 六零);
              };
            }(好全[固喵-- + 点哈 - 27], 好全[固喵-- + ++点哈 - 30], 好全[(固喵 += 点哈--) - 30], 好全[(固喵 += 90) - 117], 好全[(固喵 -= ++点哈) - 94], 好全[固喵++ - 点哈-- - 68], 好全[(固喵 += 118) + 点哈 - 236], 好全[(固喵 -= 213) - ++点哈 + 33]), 0))) {
              好全[++固喵 - 点哈-- + 25] = 盾盾[好全[固喵++ + 点哈 - 25] = 盾盾[加混++] - (点哈 + 29887 + 加混), 加混++] - (-点哈 + 54198 + 加混);
            }
          }
        } else if (点哈 > 16) {
          if ((!(点哈 > 23) || !(好全[--固喵 - 点哈++ + 21] = 喵哈(好全[固喵++ - 点哈-- + 23], [好全[固喵-- + 点哈++ - 28]])(好全[(固喵 -= 88) + --点哈 + 63], 好全[(固喵 += 86) + 点哈 - 22]), !"")) && (!(点哈 < 20) || !(点哈 > 18 && (喵哈(好全[固喵++ - ++点哈 + 18], [好全[++固喵 + 点哈-- - 25]])(好全[(固喵 -= 5) + 点哈 - 17]), !undefined) || (点哈 < 18 || (好全[固喵-- - 2] = 好全[固喵-- - 点哈-- + 17].slice(好全[固喵-- - --点哈 + 17], 好全[(固喵 += 2) - 1].length), !true)) && (好全[(固喵 += 24) + 点哈++ - 42] = 好全[(固喵 -= 24) + --点哈 - 18] !== 盾盾[加混++] - (--点哈 + 49332 + 加混)), !undefined)) && (!(点哈 < 22) || !((点哈 < 21 || (好全[++固喵 + 点哈-- - 24] = 好全[(固喵 -= --点哈) + 16] >= 好全[(固喵 += 17) - 点哈-- + 19], undefined)) && (好全[固喵 - ++点哈 + 21] = 好全[固喵++ + --点哈 - 23]), true)) && (!(点哈 < 23) || !(好全[固喵 + 点哈++ - 23] >>= 盾盾[加混++] - (--点哈 + 37424 + 加混), !""))) {
            好全[固喵 - --点哈 + 17] = 喵哈(好全[--固喵 - 3], [好全[(固喵 += 86) + 点哈++ - 112]])(好全[(固喵 += 59) + 点哈++ - 170], 好全[(固喵 += 101) - 247][好全[(固喵 -= 249) - 点哈-- + 27]]);
          }
        } else if (点哈 > 8) {
          if (!(点哈 < 12) || !((++点哈 > 11 || (点哈 > 10 && (固喵--, true) || 好全[加混++, 固喵-- - --点哈 + 8] || (加混 = 盾盾[--加混] ^ -点哈++ + 47598 + ++加混), undefined)) && (好全[(固喵 -= 112) + 点哈++ + 99] = new (哒嘿(好全[(固喵 += 112) - 点哈-- + 12])())()), !undefined)) {
            if (点哈 > 15 || ((点哈 > 13 || (点哈 < 13 && (好全[固喵 + 点哈-- - 14] = new (哒嘿(好全[--固喵 - --点哈 + 9])(null, 好全[固喵 - 点哈 + 10]))(), true) || (好全[固喵++ - 点哈-- + 7] = 六全(好全[固喵 + 点哈-- - 18], 好全[固喵-- + 点哈-- - 18], 好全[--固喵 + 点哈++ - 13], 好全[--固喵 - ++点哈 + 11], 好全[固喵++ - --点哈 + 11], 好全[(固喵 -= 4) - 点哈 + 15])()), false)) && (点哈 < 15 && (好全[(固喵 -= --点哈) + 14] = 盾盾[好全[(固喵 += 15) + 点哈++ - 15] = 盾盾[加混++] - (-点哈 + 28630 + 加混), 加混++] - (++点哈 + 60451 + 加混), !undefined) || (好全[固喵-- + 1] = 盾盾[好全[(固喵 += 3) + ++点哈 - 18] = 盾盾[加混++] - (++点哈 + 48637 + 加混), 加混++] ^ -++点哈 + 48099 + 加混)), null)) {
              加混 = 好全[加咪 = 加混, --固喵 + 点哈-- - 16];
            }
          }
        } else if (--点哈 > 5) {
          if (!(点哈 > 6) || !(好全[加混++, --固喵 + --点哈 - 6] && (加混 = 盾盾[--加混] ^ -点哈 + 65801 + ++加混), true)) {
            好全[++固喵 - ++点哈 + 4] = 哒嘿(好全[(固喵 -= 30) - --点哈 + 34], 好全[(固喵 += 28) + --点哈 - 6])(固哒(盾盾[加混++] ^ 21701 + 加混, 盾盾[加混++] ^ --点哈 + 34656 + 加混))();
          }
        } else if (点哈 > 3) {
          if (++点哈 < 6 || (好全[--固喵 + 点哈-- - 8] = 哒嘿(好全[(固喵 += 40) - --点哈 - 37], 好全[固喵-- - 点哈++ - 38])()(好全[(固喵 -= 40) + ++点哈 - 5]), null)) {
            好全[--固喵 - 点哈 + 4] = 加呀[好全[(固喵 += 点哈) - 5]] = 好全[(固喵 -= 5) - 1];
          }
        } else if (点哈++ < 2) {
          if (点哈 < 1 || ((点哈 > 1 || (好全[固喵 - --点哈 - 1] = 好全[固喵 + 点哈++ - 1][固哒(盾盾[加混++] ^ - --点哈 + 45990 + 加混, 盾盾[加混++] ^ -++点哈 + 5779 + 加混)], undefined)) && (好全[固喵++ + ++点哈 - 3] = void (盾盾[加混++] - (点哈 + 27130 + 加混))), !{})) {
            好全[固喵++ - --点哈 - 1] = [];
          }
        } else if (点哈 < 4) {
          return 好全[(固喵 -= 2) - --点哈 + 3];
        } else {
          好全[固喵 + ++点哈 - 7] = 六全(好全[(固喵 -= 点哈++) + 4], 好全[(固喵 += 4) + --点哈 - 6])();
        }
      } else if ((!(点哈 < 40) || !(点哈 < 35 && (点哈 < 33 && (好全[++固喵 + 点哈++ - 33] = 盾盾[加混++] - (-++点哈 + 33348 + 加混), !null) || 点哈 > 33 && (好全[固喵-- + 点哈-- - 36] += 好全[固喵 - --点哈 + 32], !null) || (好全[++固喵 - 点哈++ + 32] = 盾盾[加混++] ^ -++点哈 + 13917 + 加混), {}) || 点哈 > 38 && (好全[(固喵 += 115) - --点哈 - 79] = 哒呀[哒呀.length - 好全[固喵++ + 点哈-- - 154]][好全[(固喵 -= 117) + --点哈 - 37]], 1) || 点哈 > 36 && ((点哈-- < 38 || (好全[固喵 + ++点哈 - 39] = 好全[固喵 - 点哈++ + 37] == 加好[盾盾[加混++] ^ 点哈-- + 29693 + 加混], false)) && (好全[固喵-- + ++点哈 - 42] = new (哒嘿(好全[固喵-- - ++点哈 + 34], null, 好全[固喵 - ++点哈 + 37])(好全[--固喵], 好全[固喵-- + --点哈 - 37], 好全[固喵 + 点哈 - 35]))()), 1) || ++点哈 > 36 && (好全[固喵++] = 加呀[盾盾[加混++] ^ ++点哈 + 26063 + 加混], true) || (好全[固喵++ + 点哈++ - 37] = !加呀[好全[--固喵 + 点哈-- - 38]]), {})) && (!(++点哈 < 48) || !(点哈 < 43 && (点哈 > 41 && (好全[++固喵 - 1] = 固零[固哒(盾盾[加混++] ^ - --点哈 + 13061 + 加混, 盾盾[加混++] ^ -点哈-- + 17260 + 加混)], true) || (好全[固喵++ + 点哈-- - 42] = !好全[固喵-- - 点哈 + 38]), true) || (点哈 < 44 || (点哈 < 45 && (好全[(固喵 += 点哈++) - 46] = delete 好全[固喵-- + --点哈 - 90][好全[(固喵 -= 44) - 点哈++ + 44]], 1) || 点哈 < 46 && (好全[固喵++ - 点哈-- + 43] = new (喵哈(好全[--固喵 - --点哈 + 41], [null, 好全[--固喵 - 点哈 + 43]]))(), true) || (点哈 > 46 || (好全[++固喵 - 点哈++ + 41] = 哒嘿(好全[(固喵 -= 点哈++) + 43], 好全[(固喵 += --点哈) - 5])(好全[--固喵 - 2] > 好全[(固喵 -= 3) - 点哈 + 49])(), 0)) && (好全[固喵++ - 点哈++ + 47] = 固哒(盾盾[加混++] ^ -点哈 + 34961 + 加混, 盾盾[加混++] ^ -点哈 + 58146 + 加混)), false)) && (好全[固喵 - 点哈++ + 41] = 好全[(固喵 -= 111) - 点哈 + 153].slice(好全[--固喵 - 点哈 + 155], 好全[(固喵 += 111) - ++点哈 + 44].length)), true))) {
        if ((点哈 < 55 || (点哈 < 58 && (点哈 < 56 && (好全[固喵 - ++点哈 + 55] >>>= 盾盾[加混++] - (点哈 + 18232 + 加混), true) || (点哈 > 56 || (好全[加混++, --固喵 - 点哈++ + 56] || (加混 = 盾盾[--加混] ^ 点哈++ + 39077 + ++加混), "")) && (好全[固喵-- - 点哈 + 55] = 好全[固喵 - 1][好全[固喵 - 点哈-- + 57]]), true) || (点哈 > 61 || (点哈 > 59 && ((点哈-- > 60 || (好全[(固喵 -= 45) - 点哈 + 103] = 加呀[好全[(固喵 += 45) + 点哈 - 60]], "")) && (好全[固喵 - 点哈++ + 59] = new (六全(好全[固喵 - 1]))()), {}) || 点哈 < 59 && (好全[固喵 - 点哈 + 56] %= 好全[固喵-- - 点哈-- + 57], []) || (好全[++固喵 - 1] = []), false)) && (点哈++ < 63 && (好全[--固喵 - ++点哈 + 64] = -好全[固喵++ + 点哈-- - 64], true) || (好全[++固喵 + 点哈-- - 65] = true)), 0)) && (点哈 > 51 || (点哈 < 50 && ((点哈 > 48 || (好全[++固喵 - --点哈 + 38] = function (零六, 混混, 盾哒, 固固, 混喵, 点呀, 嘿固, 咪淆) {
          var 六零 = 哒呀.concat([加呀]);
          return function 零哒() {
            var 盾点 = arguments.length > 混喵.length ? 混喵.length : arguments.length;
            var 点好 = [];
            for (var 加零 = 0; 加零 < 盾点; 加零++) {
              点好[混喵[加零]] = arguments[加零];
            }
            if (嘿固) {
              点好[零六] = arguments;
            }
            if (固固) {
              点好[盾哒] = this;
            }
            if (咪淆) {
              Object.defineProperty(点好, 点呀, {
                value: 零哒,
                writable: false
              });
            }
            return 呀喵(混混, 点好, [], 六零);
          };
        }(好全[固喵 + 点哈-- - 53], 好全[--固喵 + ++点哈 - 55], 好全[固喵 - --点哈 + 43], 好全[(固喵 -= 点哈--) + 42], 好全[(固喵 -= 61) - 点哈 + 145], 好全[固喵++ - 点哈-- + 151], 好全[--固喵 + 101], 好全[(固喵 += 100) + 点哈 - 39]), !true)) && (好全[固喵 - 点哈-- + 46] = 哒嘿(好全[固喵-- + 点哈++ - 50], 好全[(固喵 -= 点哈--) + 47])(!好全[(固喵 += 48) - 点哈++ + 49])()), true) || (点哈 < 51 || (好全[固喵 + 点哈 - 53] = delete 好全[固喵-- - 点哈++ + 49][好全[固喵 + ++点哈 - 53]], undefined)) && (好全[固喵 + 点哈-- - 51] += 加好[盾盾[加混++] ^ 64452 + 加混]), null))) {
          if (!(点哈 > 53) || !(好全[++固喵 - 点哈-- + 53] = null, true)) {
            if (点哈 > 52 || (好全[(固喵 -= 点哈) + 51] = 好全[(固喵 += 52) - 点哈-- + 51] === 盾盾[加混++] - (点哈++ + 35686 + 加混), undefined)) {
              好全[++固喵 + 点哈 - 54] = 盾盾[加混++] - (16160 + 加混);
            }
          }
        }
      }
    }
  })(423);
})([122, 23999, 49878, 76, 47, 14366, 21148, 81, 57400, 7, 74, 110, 4, 34, 14017, 81, 58283, 17, 11, 34, 13942, 34, 14323, 34, 13931, 81, 58062, 30, 9, 66871, 11, 81, 57472, 81, 58492, 57, 76, 119, 16631, 5393, 11, 64, 81, 58322, 114, 117, 120, 54, 102, 21443, 81, 57516, 17, 11, 4, 88, 88, 92, 53994, 3989, 81, 57348, 27, 81, 58189, 71, 105, 81, 57495, 116, 120, 64, 37, 26174, 47, 41505, 51623, 81, 58299, 59, 87, 68, 56, 39327, 11, 81, 57397, 116, 122, 65093, 24938, 120, 64, 81, 57442, 65, 3, 27231, 81, 57429, 53, 16266, 81, 57429, 120, 64, 37, 26208, 92, 781, 57034, 81, 58586, 11, 33, 33430, 36, 34, 13397, 81, 57946, 64, 102, 21517, 72, 41252, 55830, 81, 57905, 98, 92, 25165, 49064, 13, 110, 4, 34, 13925, 81, 57993, 102, 21535, 72, 34934, 62310, 92, 32274, 41907, 81, 58332, 72, 3904, 29737, 47, 57480, 35838, 81, 57863, 20, 88, 88, 4, 114, 76, 31, 15374, 30590, 11, 64, 81, 57362, 81, 58187, 11, 92, 52213, 5777, 81, 57788, 9, 65583, 11, 26, 30140, 54406, 81, 57492, 120, 64, 37, 26292, 47, 14667, 21455, 81, 57346, 102, 21591, 42, 54431, 41748, 47, 60577, 34364, 81, 58641, 102, 21606, 3, 27343, 100, 34, 13122, 81, 58710, 72, 15466, 16530, 30, 92, 27151, 46747, 81, 58681, 37, 26326, 42, 12300, 18414, 47, 41370, 51973, 81, 57362, 77, 121, 26334, 42, 26205, 4542, 81, 58647, 112, 10, 47830, 15, 28949, 60793, 81, 57862, 60, 122, 12823, 44906, 53, 16416, 81, 57490, 4, 66, 64, 37, 26365, 81, 58685, 98, 68, 122, 46120, 10521, 47, 41981, 52891, 81, 57344, 114, 102, 21669, 31, 4742, 24531, 81, 58037, 120, 54, 102, 21679, 33, 33609, 81, 57572, 57, 122, 45806, 12035, 30, 47, 523, 28566, 81, 57433, 57, 5, 31, 51159, 35473, 11, 64, 81, 57841, 29, 9, 66115, 54, 33, 33638, 81, 57370, 99, 11, 81, 57755, 11, 54, 81, 58652, 116, 30, 2, 22741, 64459, 47, 14886, 22524, 81, 57609, 24, 11, 64, 37, 26443, 47, 60194, 34506, 81, 58316, 116, 119, 35753, 57225, 49, 11, 81, 57808, 114, 42, 20938, 8453, 92, 32583, 42142, 81, 57947, 25, 2, 59820, 17555, 68, 92, 56351, 1984, 81, 57759, 122, 60081, 30719, 42, 7898, 28198, 81, 57529, 119, 12418, 25833, 2, 64889, 20584, 81, 58711, 57, 72, 27529, 5760, 92, 1538, 56817, 81, 57466, 72, 60960, 37664, 2, 10386, 34195, 81, 58211, 118, 68, 121, 26567, 11, 34, 13139, 81, 57810, 60, 96, 88, 33, 33781, 30, 81, 57693, 89, 9315, 33533, 85, 53, 16589, 81, 58339, 114, 31, 59864, 42129, 97, 61166, 81, 58222, 122, 23670, 49311, 5, 92, 27130, 45706, 81, 57355, 54, 118, 30, 9, 66310, 11, 53, 16620, 81, 58331, 60, 3, 27594, 118, 34, 14446, 81, 57926, 53, 16628, 48, 109, 16, 49135, 48734, 81, 59014, 120, 64, 37, 26581, 47, 28025, 972, 81, 57572, 116, 2, 40287, 12453, 30, 47, 460, 28501, 81, 58007, 53, 16702, 52, 36298, 104, 68, 34, 14706, 81, 58113, 70, 97, 61235, 11, 54, 33, 33826, 81, 57751, 114, 30, 2, 15915, 37651, 5, 92, 38410, 17103, 81, 58088, 120, 54, 37, 26628, 92, 23539, 36653, 81, 58296, 108, 35918, 11, 26, 30449, 54713, 81, 57362, 122, 61582, 25509, 120, 54, 33, 33863, 81, 57353, 114, 2, 53314, 32062, 47, 61184, 32925, 81, 58132, 102, 21952, 72, 61383, 37059, 68, 81, 57982, 57, 42, 12132, 24362, 47, 41548, 52719, 81, 57653, 37, 26678, 42, 14060, 17998, 30, 81, 58168, 114, 8, 16116, 57446, 11, 88, 59, 81, 58071, 53, 16756, 95, 27856, 11, 53, 16760, 81, 57732, 34, 15064, 34, 14392, 33, 33924, 79, 54, 81, 57579, 60, 72, 42781, 55535, 47, 2157, 26605, 81, 58097, 116, 122, 48416, 11849, 92, 3382, 55489, 81, 57736, 26, 30543, 54807, 26, 30546, 54810, 81, 59123, 68, 53, 16801, 108, 36029, 11, 30, 81, 57503, 46, 11, 64, 102, 22037, 34, 15432, 81, 57726, 11, 72, 4245, 28603, 68, 47, 51752, 42347, 81, 57513, 73, 63, 9, 66359, 81, 58148, 81, 57983, 116, 120, 64, 102, 22070, 92, 62789, 8198, 81, 57396, 33, 34004, 79, 63, 41, 92, 53448, 1452, 81, 58315, 26, 30607, 54872, 27, 81, 57856, 81, 59269, 113, 54, 100, 68, 121, 27087, 11, 81, 58304, 116, 42, 56322, 44979, 120, 64, 81, 57387, 116, 122, 48258, 10671, 92, 46160, 24792, 81, 59287, 98, 92, 30001, 41352, 68, 92, 15445, 59623, 81, 57914, 13, 110, 4, 81, 58147, 81, 57425, 26, 30658, 54922, 26, 30661, 54926, 81, 58118, 17, 11, 102, 22150, 53, 16921, 81, 58290, 2, 54060, 31756, 42, 13846, 17796, 81, 57685, 114, 122, 48332, 10717, 92, 15545, 59490, 81, 57680, 50, 65233, 39, 30512, 34, 15712, 81, 59262, 37, 26888, 42, 8062, 27842, 92, 26292, 45592, 81, 57793, 114, 42, 13879, 17829, 92, 29085, 42276, 81, 57916, 26, 30718, 54982, 15, 29426, 61277, 81, 58022, 98, 42, 39839, 60400, 120, 54, 81, 57454, 98, 122, 61863, 25676, 120, 64, 81, 57771, 37, 26933, 42, 7313, 27677, 92, 15612, 60319, 81, 57490, 58, 18, 50197, 9, 66560, 92, 56825, 2726, 81, 57664, 107, 123, 117, 123, 80, 81, 57443, 90, 68, 121, 27462, 11, 34, 14438, 81, 57689, 53, 17046, 55, 19243, 33, 34185, 81, 57576, 22, 68, 9, 66658, 11, 34, 15211, 81, 58280, 98, 30, 122, 58550, 29180, 92, 29482, 42186, 81, 57535, 116, 31, 59897, 42088, 92, 35926, 23435, 81, 58336, 116, 122, 48200, 10593, 92, 15413, 60390, 81, 57843, 98, 30, 122, 34167, 4223, 92, 29518, 42230, 81, 59346, 114, 2, 53964, 32684, 47, 33333, 61310, 81, 58303, 102, 22322, 42, 34536, 63122, 30, 81, 57989, 59, 15, 29556, 61407, 15, 29559, 61410, 81, 57679, 24, 11, 54, 102, 22342, 47, 27425, 436, 81, 59270, 82, 34, 14776, 1, 15, 29578, 61429, 81, 59109, 66, 54, 37, 27071, 92, 38104, 17321, 81, 59291, 114, 72, 60513, 37217, 7, 7, 75, 81, 58846, 68, 122, 48974, 10346, 37, 27088, 81, 58415, 82, 72, 16940, 16127, 68, 47, 53503, 47691, 81, 58805, 24, 11, 54, 102, 22399, 92, 60020, 16050, 81, 59208, 17, 53, 17266, 23, 38487, 33, 34332, 81, 59178, 68, 10, 48533, 11, 81, 58685, 81, 58426, 114, 122, 49097, 10464, 47, 59878, 33663, 81, 58979, 116, 122, 41776, 13368, 47, 26969, 564, 81, 58789, 11, 72, 35983, 63471, 12, 4, 81, 59296, 114, 72, 42439, 57001, 92, 28893, 42085, 81, 58629, 86, 81, 58571, 81, 59030, 81, 59172, 122, 62143, 25940, 2, 58960, 19311, 81, 58751, 48, 67, 89, 9973, 34652, 1, 81, 59131, 114, 72, 16130, 17450, 30, 92, 13467, 57813, 81, 59201, 65, 78, 38732, 81, 57576, 33, 34423, 81, 57568, 26, 31018, 55282, 48, 67, 124, 49218, 81, 59307, 26, 31027, 55291, 26, 31030, 55294, 81, 57592, 98, 68, 2, 13196, 37234, 5, 47, 6297, 29458, 81, 58799, 33, 34453, 72, 16370, 17658, 30, 92, 14067, 58174, 81, 57473, 60, 2, 23820, 65084, 53, 17310, 81, 58944, 33, 34492, 103, 3780, 33, 402687656, 81, 58405, 116, 2, 37091, 13249, 120, 33, 34510, 81, 58678, 102, 22562, 72, 26756, 5053, 47, 59764, 33289, 81, 59258, 42, 7669, 28025, 120, 54, 33, 34509, 81, 59223, 85, 53, 17351, 95, 28458, 11, 81, 57513], [0.5, 0.6, 1.1, "蓆蓴蓵蓳蓷", "棑棤棥棘棦棩梖棝棙棢棦棠棠", "ⲝⲰⲱⲤⲲⲵⱢⲩⲥⲮⲲⲬⲬⲃⱪ", "旂族族旅旄旘", "ỺỼἙἚỾ", "", "㕖㕩㕪㕝㕫㕮㕏㕤㕯㕭㕶㕳㔡㕨㕤㕭㕱㕫㕫", "НажЭйт", "诿读诠谂谁诹诿诹", "㺂㺒㺌㺂㺔㺊㺑㺑㹄㹼㺏㺕㺌㺘㺡㹓㹕㹍㺩㹏㺋㺟㺓㺧㺝㺫㺛㹗㺛㺨㺞㺠㺙㹝㺻", "⥏⥒⥐⥖⥒⥘⥞⥖⥌", "㡄㡙㡍㡖㡒㡑㡣㠐㡈㡛㡡㡘㡤㡭㡔", "旡既旴旷旵旻旷旨早", "찎찣찗찠찜찛찭쯚찒찥찫찢찮찷찑찴찲찴찪참찻찱찮창차", "캈캝캑캚캖캕캧칔칺캬캜캦캭캎캜캮캤캣캳캝", "냊냞냧냣냢냴", "揙揓揦揃揬揤", "⬏⬂⬈⫿⬋⬔", "㨕㨨㨮㨥㨱㨺㨔㨷㨵㨷㨭㨻㨾㨴㨱㩀", "茗茝茡茕茕茡茊茟茡茬", "귷귪귲귭", "䁞䁚䁜", "", "拮拢拸括拫拦拺拶拺", "嗛嗯嘅嗹嗸嗳嘇嘃嘇", "냀냕냉냒냎냍냟낌낻냏냥냙냘냓냧냣냧냓", "钵铅钿钵铇钽铄铄鑷钦钺铐铄铃钾铒铎铒钉钋钃铟钅铁铕铉铝铓铡铑钍铑铞铔铖铏钓铱", "鸫鸛鸥鸜鸨鸬", "", "刞初刐刞凮刕刔刞別", "泛泖泫泦", "漲漱潁漝潆漾漡潄潂潄漺潈潋潑漝漿潎漿潏潇潏潔潐潔潖", "", "", "ਲ਼੟੔੧੠ਖ਼੣੪", "᪢᫄᪺᪼", "旱昣易昝昤昅易春昛昚昪", "㶔㶓㶣㵿㶨㶠㶃㶦㶤㶦㶜㶪㶭㶳㵿㶡㶰㶡㶱㶩㶱㶶㶲㶶", "혳홀홀혹혽혼홋홉혹혻홆홀", "峹峸崈", "", "䣳䣟䣫䣵䣦", "쵟쵳쵵쵼쵶쵵춇", "禴秀禺秈秋", "凸刈凼凹刍凿几刈刂刋刄刎刕", "鵻鶈鶈鶎鶋鶉鶃", "䅍䅑䅊", "橉橌樻樼樿橎橏", "", "됢됞됧됫됥됥"], function () {
  if (typeof globalThis === "undefined") {
    globalThis = typeof window === "undefined" ? typeof global !== "undefined" ? global : this : window;
  }
  if (typeof exports !== "undefined") {
    globalThis.exports = exports;
  }
  if (typeof require !== "undefined") {
    globalThis.require = require;
  }
  if (typeof module !== "undefined") {
    globalThis.module = module;
  }
  if (typeof __filename !== "undefined") {
    globalThis.__filename = __filename;
  }
  if (typeof __dirname !== "undefined") {
    globalThis.__dirname = __dirname;
  }
  return globalThis;
}(), Object.call.bind(Array.bind), Array.apply.bind(Number.bind), Number.bind.bind(Object.bind), Object.call.bind([].push), Array.call.bind("".charCodeAt), Number.apply.bind(String.fromCharCode, null), String.fromCharCode, Array.call.bind([].join), String.call.bind([].reverse), Array.call.bind("".split), []);